# Плагіни та conftest.pyфайли можуть оголошувати нові гачки,
# які потім можуть бути реалізовані іншими плагінами, щоб змінити поведінку або взаємодіяти з новим плагіном:

# Зазвичай хуки оголошуються як функції "нічого не робити", які містять лише документацію, яка описує,
# коли буде викликано хук і які очікувані повернені значення.
# Назви функцій повинні починатися на pytest_інакше pytest не розпізнає їх.

# Тепер ваш гачок готовий до використання. Щоб зареєструвати функцію на гачку,
# інші плагіни або користувачі тепер повинні просто визначити
# функцію pytest_my_hookз правильним підписом у своїй conftest.py.


def pytest_my_hook(config):
    """
    Print all active hooks to the screen.
    """
    print(config.hook)
